SM_для_EDT/src/Documents/впЗаявкаНаСнабжение/впЗаявкаНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗаявкаНаСнабжение</name>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <registerRecords>InformationRegister.впЗаявкиНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>IDремонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПотребности</name>
    <type>
      <types>EnumRef.рарусВидыПотребностиЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьРедактирования</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСудовойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.рарусСтатусыСогласованияЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБереговойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииСудовойЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БереговаяСлужба</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>CatalogRef.рарусБереговыеСлужбы</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗаявки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>EnumRef.рарусКатегорииЗаявокНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияИзмененияВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеАналоговНеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.рарусСостоянияЗаявокНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Доработать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДоработки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.рарусНоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтрокиЗаблокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиваемаяНоменклатура</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗамены</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСогласующего</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСогласования</name>
      <type>
        <types>EnumRef.рарусСтатусыСогласованияАналогов</types>
      </type>
    </attributes>
    <attributes>
      <name>IDПервоначальный</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDДинамический</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединенныеФайлыСтрок</name>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.впЗаявкаНаСнабжениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМасло</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТопливо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(рарус)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>рспбКодMDG</name>
    <comment>Рарус-СПб Бойко А.Ю.23.09.2019</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.рарусКатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>CatalogRef.впПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНоменклатуры</name>
    <comment>Для реализации механизма различных блокировок SAP</comment>
    <type>
      <types>EnumRef.рспбСтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <comment>makole ЗНИ РАIT-0023374</comment>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/CommonModules/рарусХранениеВерсийПереопределяемый/Module.bsl
Функция ОписаниеОбъекта(ТипОбъекта) Экспорт
	
	Описание = Новый Структура;
	
	Если ТипОбъекта = Тип("ДокументСсылка.впЗаявкаНаСнабжение") 
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.впЗаявкаНаСнабжение")тогда
		
		Описание = ОписаниеЗаявкиНаСнабжение();
		
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

Функция ОписаниеЗаявкиНаСнабжение()
	
	Описание = Новый Структура;
	
	ОписаниеРеквизитовТЧ = Новый Структура;
	ОписаниеРеквизитовТЧ.Вставить("Номенклатура","Номенклатура (исх)");
	
	//ОписаниеРеквизитовТЧ.Вставить("ОписаниеДополнительныхРеквизитовНоменклатуры","Описание (исх)");	
	ОписаниеРеквизитовТЧ.Вставить("ОписаниеНоменклатуры",
		Новый Структура("РеквизитФормы, Заголовок","ОписаниеДополнительныхРеквизитовНоменклатуры", "Описание (исх)")
	);
	
	ОписаниеРеквизитовТЧ.Вставить("КоличествоУпаковок", "Количество (исх)");
	ОписаниеРеквизитовТЧ.Вставить("Упаковка", "Ед. изм (исх)");
	ОписаниеРеквизитовТЧ.Вставить("ОбластьСоздания", "Создана");
	
	ОписаниеТЧ = Новый Структура("МатериалыИРаботы", ОписаниеРеквизитовТЧ);
	
	Описание.Вставить("ТабличныеЧасти", ОписаниеТЧ);
	
	Возврат Описание;
	
КонецФункции

#Область ПриСоздании

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Форма.ИмяФормы = "Документ.впЗаявкаНаСнабжение.Форма.ФормаДокумента" тогда
		
		ПриСозданииНаСерверевпЗаявкаНаСнабжениеФормаДокумента(Форма);	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриСозданииНаСерверевпЗаявкаНаСнабжениеФормаДокумента(Форма) 
	
	АдресНастроек = Форма.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд;	
	ТаблицаКоманд = ПолучитьИзВременногоХранилища(АдресНастроек);
	СтрокаКоманды = ТаблицаКоманд.Найти("ПоказатьИсходныеДанные", "Вид");
	
	Если СтрокаКоманды <> Неопределено Тогда
		
		Кнопка = Форма.Элементы.Добавить("ПоказатьИсходныеДанные", Тип("КнопкаФормы"), Форма.Элементы.МатериальныеЗатратыКоманднаяПанель);
		Кнопка.Заголовок = "Показать исходные данные";
		Кнопка.ИмяКоманды = СтрокаКоманды.ИмяВФорме;		
		Кнопка.Отображение = ОтображениеКнопки.Текст;
		
	КонецЕсли;
	
	Элемент = Форма.Элементы.Вставить(
		"МатериальныеЗатратыПричинаНеУказанаКартинка", 
		Тип("ПолеФормы"),
		Форма.Элементы.МатериальныеЗатраты,
		Форма.Элементы.МатериальныеЗатратыНомерСтроки
	);
	
	Элемент.ПутьКДанным = "Объект.МатериалыИРаботы.ПричинаНеУказанаКартинка";	
	Элемент.Вид = ВидПоляФормы.ПолеКартинки;			
	Элемент.КартинкаШапки = БиблиотекаКартинок.Комментарий;
	Элемент.КартинкаЗначений = БиблиотекаКартинок.ОтсутствуетСогласие;
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;	
	Элемент.Видимость = Истина;
	Элемент.ТолькоПросмотр = Истина;
	Элемент.РастягиватьПоГоризонтали = Ложь;
	Элемент.АвтоМаксимальнаяШирина = Истина;
	Элемент.Ширина = 3;
	
	Элемент = Форма.Элементы.Вставить(
		"СтраницаИсторияИзмененияВерсий", 
		Тип("ГруппаФормы"),
		Форма.Элементы.Страницы,		
	);  
	Элемент.РастягиватьПоГоризонтали = Истина;
	Элемент.Заголовок = "История изменения";
	
	Элемент = Форма.Элементы.Вставить(
		"ИсторияИзмененияВерсий", 
		Тип("ПолеФормы"),
		Форма.Элементы.СтраницаИсторияИзмененияВерсий		
	);
	
	Элемент.ПутьКДанным = "Объект.ИсторияИзмененияВерсий";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Элемент.МногострочныйРежим = Истина;
	Элемент.ТолькоПросмотр = Истина;
	Элемент.РастягиватьПоГоризонтали = Истина;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	
КонецПроцедуры	

#КонецОбласти 

Процедура ЗаполнитьИсходныеДанныеТабличнойЧасти(Источник, Таблица) Экспорт
	
	Для Каждого СтрокаТаблицы Из Таблица цикл
				
		Если СтрокаТаблицы.ОбластьСоздания_исх = рарусЗаявкаНаСнабжениеСервер.ОбластьРедактированияНаСудне() тогда
			СтрокаТаблицы.ПризнакДобавленияКартинка = 0;
		ИначеЕсли  СтрокаТаблицы.ОбластьСоздания_исх = рарусЗаявкаНаСнабжениеСервер.ОбластьРедактированияНаБерегу() тогда
			СтрокаТаблицы.ПризнакДобавленияКартинка = 1; 
		Иначе
			СтрокаТаблицы.ПризнакДобавленияКартинка = -1; 	
		КонецЕсли;	
					
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПриОпределенииКомандПодключенныхКОбъекту(Команда) Экспорт
	
	МассивФорм = Новый Массив;
	МассивФорм.Добавить("Документ.впЗаявкаНаСнабжение.Форма.ФормаДокумента");
	
	Команда.ВидимостьВФормах = СтрСоединить(МассивФорм,","); 
	
КонецПроцедуры

Процедура ЗаполнитьИсходныеДанные(Источник) Экспорт
	
	ОписаниеОбъекта = ОписаниеОбъекта(ТипЗнч(Источник));
	
	рарусХранениеВерсий.ЗаписатьДанныеJSON(ОписаниеОбъекта, Источник);
	
КонецПроцедуры	

Процедура ЗаполнитьРеквизитыПоСтроке(Реквизиты, СтрокаТЧ, Источник) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	
	Если ТипОбъекта = Тип("ДокументСсылка.впЗаявкаНаСнабжение") 
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.впЗаявкаНаСнабжение") тогда
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Упаковка) тогда
			Реквизиты.Упаковка = СтрокаТЧ.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
		Реквизиты.ОписаниеНоменклатуры= рарусЗаявкаНаСнабжениеСервер.ОписаниеДополнительныхРеквизитовНоменклатуры(СтрокаТЧ.Номенклатура);
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура СоздатьЭлемент(Форма, Имя, ПутьКДанным, Заголовок) Экспорт
	
	Если СтрНайти(ВРег(ПутьКДанным),  ВРег("ОбластьСоздания")) тогда
		
		ЧастиПути  = СтрРазделить(ПутьКДанным,".");
		ЧастиПути.Удалить(2);
		ПутьТЧ = СтрСоединить(ЧастиПути,".");
		
		Элемент = Форма.Элементы.Вставить(Имя, Тип("ПолеФормы"), Форма.Элементы.МатериальныеЗатраты);
		Элемент.ПутьКДанным = СтрШаблон("%1.%2", ПутьТЧ,"ПризнакДобавленияКартинка");
		
		Элемент.Вид = ВидПоляФормы.ПолеКартинки;			
		//Элемент.КартинкаШапки = БиблиотекаКартинок.рарусКоллекцияКорабльЯкорь;
		Элемент.КартинкаЗначений = БиблиотекаКартинок.рарусКоллекцияКорабльЯкорь;
		//Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;	
		Элемент.Заголовок = Заголовок;
		Элемент.Видимость = Истина;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.Ширина = 5;
	
	Иначе	
		
		Элемент = Форма.Элементы.Вставить(Имя, Тип("ПолеФормы"), Форма.Элементы.МатериальныеЗатраты);
		Элемент.ПутьКДанным = ПутьКДанным;	
		Элемент.Заголовок = Заголовок;
		Элемент.ТолькоПросмотр = Истина;		
		
	КонецЕсли;
	
	Элемент.ЦветФонаЗаголовка = WebЦвета.Голубой;
		
КонецПроцедуры	

Процедура СоответствиеТипов(СоответствиеТипов) Экспорт
	
	СоответствиеТипов.Вставить("СправочникСсылка.Номенклатура", 					"Справочник.Номенклатура");
	СоответствиеТипов.Вставить("СправочникСсылка.УпаковкиЕдиницыИзмерения",			"Справочник.УпаковкиЕдиницыИзмерения");
	СоответствиеТипов.Вставить("ПеречислениеСсылка.рарусОбластиРедактирования",		"Перечисление.рарусОбластиРедактирования");

КонецПроцедуры

// Добавляет строку в таблицу соответствия типов
// 
Процедура ДобавитьСтроку(Таблица, ИмяHTTP, Имя) Экспорт
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ИмяHTTP = ИмяHTTP;
	НоваяСтрока.Имя = Имя;
	
КонецПроцедуры

Процедура ВерсияСтрокиJSON(Реквизиты) Экспорт
	
	Если Реквизиты.Свойство("ОбластьСоздания") тогда
		Реквизиты.ОбластьСоздания = рарусЗаявкаНаСнабжениеСервер.ОбластьРедактированияНаСудне();	
	КонецЕсли;
	
КонецПроцедуры	

#Область РедактированиеСтроки

Функция НеобходимаПричинаРедактирования(Объект, ИмяЭлементаФормы) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	
	НеобходимаПричинаРедактирования = Ложь;
	
	Если ТипОбъекта = Тип("ДокументСсылка.впЗаявкаНаСнабжение") 
		ИЛИ ТипОбъекта = Тип("ДокументОбъект.впЗаявкаНаСнабжение") тогда
		
		МассивЭлементов = Новый Соответствие;
		МассивЭлементов.Вставить("МатериальныеЗатратыНоменклатура", Истина);
		МассивЭлементов.Вставить("МатериальныеЗатратыУпаковка", Истина);
		МассивЭлементов.Вставить("МатериальныеЗатратыКоличествоУпаковок", Истина);
		МассивЭлементов.Вставить("МатериальныеЗатратыОтменено", Истина);
		
		Если МассивЭлементов.Получить(ИмяЭлементаФормы) = Истина тогда
			НеобходимаПричинаРедактирования = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат НеобходимаПричинаРедактирования;
	
КонецФункции

#КонецОбласти 

#Область РаботаСФормой

Процедура УстановитьУсловноеОформление(Форма) Экспорт
	
	ОписаниеОбъекта = ОписаниеОбъекта(ТипЗнч(Форма.Объект.Ссылка));	
	
	Если ОписаниеОбъекта.Свойство("ТабличныеЧасти") тогда
		
		Для Каждого ТЧ Из ОписаниеОбъекта.ТабличныеЧасти цикл						
						
			Для Каждого ЭлементТЧ Из ТЧ.Значение цикл								
								
				ИмяРеквизита = рарусХранениеВерсий.ИмяРеквизита(ЭлементТЧ.Ключ);
				
				ИмяЭлемента = рарусХранениеВерсий.ИмяЭлемента(ТЧ.Ключ, ИмяРеквизита);
				
				Если ВРег(ЭлементТЧ.Ключ) = ВРег("ОбластьСоздания") тогда
					
					ВыключитьЭлементУсловногоОформления(ИмяЭлемента, Форма);
					
					Элемент = Форма.УсловноеОформление.Элементы.Добавить();
					
					ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
					ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
					//ПолеЭлемента.Использование = Истина;
					// выключено в данной версии
					ПолеЭлемента.Использование = Ложь;
					
					ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2.%3","Объект", ТЧ.Ключ, ИмяРеквизита));
					ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					ОтборЭлемента.ПравоеЗначение = рарусЗаявкаНаСнабжениеСервер.ОбластьРедактированияНаСудне();
					ОтборЭлемента.Использование = Истина;
					
					ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2.%3","Объект", ТЧ.Ключ, "ВерсияСтрокиЗаблокирована"));
					ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ОтборЭлемента.ПравоеЗначение = Истина;
					ОтборЭлемента.Использование = Истина;
					
				    Цвет = Неопределено;
					ЦветОтличияЗначений(Цвет);
					
					Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет);
					
				ИначеЕсли  ВРег(ЭлементТЧ.Ключ) = ВРег("Упаковка") тогда
					
					ВыключитьЭлементУсловногоОформления(ИмяЭлемента, Форма);
					
					Элемент = Форма.УсловноеОформление.Элементы.Добавить();
					
					ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
					ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
					ПолеЭлемента.Использование = Истина;
					
					ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2.%3","Объект", ТЧ.Ключ, ЭлементТЧ.Ключ));
					ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
					ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2.%3","Объект", ТЧ.Ключ, ИмяРеквизита));
					ОтборЭлемента.Использование = Истина;
					
					ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2.%3","Объект", ТЧ.Ключ, ЭлементТЧ.Ключ));
					ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;					
					ОтборЭлемента.Использование = Истина;
					
					ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("%1.%2.%3","Объект", ТЧ.Ключ, "ВерсияСтрокиЗаблокирована"));
					ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ОтборЭлемента.ПравоеЗначение = Истина;
					ОтборЭлемента.Использование = Истина;
					
					Цвет = Неопределено;
					ЦветОтличияЗначений(Цвет);
					
					Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет); 	
					
				КонецЕсли;
								
			КонецЦикла;	
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыключитьЭлементУсловногоОформления(ИмяЭлемента, Форма)
	
	Для Каждого ЭлементУО Из Форма.УсловноеОформление.Элементы цикл
		
		Для Каждого ЭлементПоле Из ЭлементУО.Поля.Элементы Цикл
			
			Если ЭлементПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента) тогда
				ЭлементУО.Использование = Ложь;
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЦикла;

КонецПроцедуры	

Процедура ЦветОтличияЗначений(Цвет) Экспорт
	
	Цвет = WebЦвета.БледноЛиловый;
	
КонецПроцедуры	

Процедура ЗаписатьКомментарииВИсторию(Объект, ТекущийОбъект, ПараметрыЗаписи, МассивСтрок) Экспорт

	ОписаниеОбъекта = ОписаниеОбъекта(ТипЗнч(ТекущийОбъект));
	
	Если ОписаниеОбъекта.Свойство("ТабличныеЧасти") тогда
		
		Для Каждого ТЧ Из ОписаниеОбъекта.ТабличныеЧасти цикл
			
			Для Каждого СтрокаТаблицы Из Объект[ТЧ.Ключ] цикл
				
				ПричинаВерсии = СтрокаТаблицы.ПричинаВерсии;
				Если ЗначениеЗаполнено(ПричинаВерсии) тогда
					
					НомерСтроки = СтрокаТаблицы.НомерСтроки;
					
					МассивСтрокИзмененныхПолей = Новый Массив;
					
					//
					ЗначениеБыло = ТекущийОбъект.Ссылка[ТЧ.Ключ][НомерСтроки-1].Номенклатура;
					ЗначениеСтало = ТекущийОбъект[ТЧ.Ключ][НомерСтроки-1].Номенклатура;					
					Если ЗначениеБыло <> ЗначениеСтало тогда
						МассивСтрокИзмененныхПолей.Добавить(СтрШаблон("%1 с %2 на %3", "Номенклатура", ЗначениеБыло, ЗначениеСтало));
					КонецЕсли;
					//
					
					//
					ЗначениеБыло = ТекущийОбъект.Ссылка[ТЧ.Ключ][НомерСтроки-1].Количество;
					ЗначениеСтало = ТекущийОбъект[ТЧ.Ключ][НомерСтроки-1].Количество;					
					Если ЗначениеБыло <> ЗначениеСтало тогда
						МассивСтрокИзмененныхПолей.Добавить(СтрШаблон("%1 с %2 на %3", "Количество", ЗначениеБыло, ЗначениеСтало));
					КонецЕсли;
					//
					
					//
					ЗначениеСтало = ТекущийОбъект[ТЧ.Ключ][НомерСтроки-1].Упаковка;					
					Если ЗначениеЗаполнено(ЗначениеСтало) тогда
						ЗначениеБыло = ТекущийОбъект.Ссылка[ТЧ.Ключ][НомерСтроки-1].Упаковка;						
						Если ЗначениеБыло <> ЗначениеСтало тогда
							МассивСтрокИзмененныхПолей.Добавить(СтрШаблон("%1 с %2 на %3", "Упаковка", ЗначениеБыло, ЗначениеСтало));
						КонецЕсли;
					КонецЕсли;
					//
					
					//
					ЗначениеСтало = ТекущийОбъект[ТЧ.Ключ][НомерСтроки-1].Отменено;	
					ЗначениеБыло = ТекущийОбъект.Ссылка[ТЧ.Ключ][НомерСтроки-1].Отменено;				
					Если ЗначениеБыло <> ЗначениеСтало тогда
						МассивСтрокИзмененныхПолей.Добавить(СтрШаблон("%1 с %2 на %3", "Отменено", ЗначениеБыло, ЗначениеСтало));
					КонецЕсли;					
					//
					
					СтрокаИзмененыхПолей = СтрСоединить(МассивСтрокИзмененныхПолей," и ");
					
					Если МассивСтрокИзмененныхПолей.Количество() > 1 тогда
						ПолеПолей = "полей";
					Иначе 
						ПолеПолей = "поля";
					КонецЕсли;	
					
					//"[Дата, время]. [Пользователь] изменил в строке [Номер строки] значение [поля/полей] [[Имя поля] с [Значение было] на [Значение стало]] по причине [Причина изменений] 
					ШаблонСтроки = "%1. %2 изменил в строке %3 значение %4 %5 по причине: %6";
					
					МассивСтрок.Добавить(
							СтрШаблон(ШаблонСтроки,
						 		ТекущаяДатаСеанса(), 
								Пользователи.ТекущийПользователь(),
								НомерСтроки,
								ПолеПолей,
								СтрокаИзмененыхПолей,
								ПричинаВерсии
							)
						);
					
			    КонецЕсли;

			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
